Конфигурации/DataProcessors/МоиЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>МоиЗадачи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурации/InformationRegisters/ПланированиеТРЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ПланированиеТРЗ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УправлениеЗадачей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурации/DataProcessors/МоиЗадачи/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос();
КонецПроцедуры

&НаСервере
Процедура Запрос()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиИсполнителяЗадачиПоИсполнителю.Ссылка КАК Задача,
		|	ЗадачиИсполнителяЗадачиПоИсполнителю.Основание КАК Основание,
		|	ПланированиеТРЗ.Часы,
		|	ПланированиеТРЗ.Статус
		|ИЗ
		|	Задача.ЗадачиИсполнителя.ЗадачиПоИсполнителю КАК ЗадачиИсполнителяЗадачиПоИсполнителю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПланированиеТРЗ КАК ПланированиеТРЗ
		|		ПО ЗадачиИсполнителяЗадачиПоИсполнителю.Основание = ПланированиеТРЗ.СсылкаНаДокумент
		|ГДЕ
		|	ПланированиеТРЗ.Период = &Период";
	
	Запрос.УстановитьПараметр("Период", Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), День(ТекущаяДата())));
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗадачиДня.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Запрос();
КонецПроцедуры
